// const transformToObject = arr => {
//   const obj = {};

//   arr.forEach(el => {
//     obj[el] = el;
//   });

//   return obj;
// };

// // examples
// console.log(transformToObject(['a', 17.1, 'John Doe'])); // ==> { a: 'a', '17.1': 17.1, 'John Doe': 'John Doe' }
// console.log(transformToObject([]));

//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------

// const user = {
//   name: "John Doe",
//   age: 17,
//   interest: "football",
// };

// const concatProps = (obj) => {
//   const result = [];
//   for (const key in obj) {
//     result.push(obj[key]);
//   }
//   return result;
// };

// // examples
// console.log(concatProps(user)); // ==> ['John Doe', 17, 'football']

// const user {
//   name: "John Doe",
//   age: 17,
//   interest: "football",
// };

// const concatProps = (obj) => {
//   return Object.values(obj);
// };

// // example
// console.log(concat(user));  // ==> ['John Doe', 17, 'football']

//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------

// const transaction = {
//   currency: 'USD',
//   value: 170,
//   operation: 'sale',
//   agent: {
//     country: 'Ukraine',
//     company: 'NYSE',
//   },
//   'operation time': 1584029990001,
// };

// /* 1. Выведи в консоль значение свойства 'currency' с помощью точки */
// console.log(transaction.currency);
// /* 2. Выведи в консоль значение свойства 'value' с помощью квадратных скобок */
// console.log(transaction['value']);
// const key = 'operation';
// /* 3. Выведи в консоль значение свойства обьекта transaction, название которого находится в переменной key - используй квадратные скобки */
// console.log(transaction[key]);
// /* 4. Введи в консоль значение свойства 'company' используя квадратные скобки */
// console.log(transaction.agent['company']);
// /* 5. Выведи в консоль значение свойства 'country' используя точку */
// console.log(transaction.agent.country);
// /* 6. Выведи в консоль значение свойства 'operation time' используя квадратные скобки */
// console.log(transaction['operation time']);

//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------

// const user = {
//   name: 'Tom',
//   age: 17,
// };

// /* присвой объекту свойство hobby со значением 'football' с помощью точки */
// user.hobby = 'football';
// const anotherKey = 'married';
// /* название свойства хранится в переменной anotherKey. Присвой объекту такое свойство со значением false */
// user[anotherKey] = false;
// /* присвой объекту свойство 'favorite music' со значением 'rock' */
// user['favorite music'] = 'rock'; 
// /* присвой объекту свойство 'address', которое будет пустым объкетом */
// user.address = {};
// /* присвой объекту в 'address' свойство 'country', со значением 'Ukraine' */
// user.address.country = 'Ukraine';
// /* присвой объекту в 'address' свойство 'building', со значением 17 */
// user.address.building = 17;
// /* выведи в консоль итоговый объект user */
// console.log(user);

//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------

// /* Для решения этой задачи используй for..in цикл. В реальных проектах это плохая практика,
//  * лучше использовать методы класса Object - keys(), values(), entries(). Но мы с ними пока не познакомитись.
//  * Чтобы eslint не ругался на эту ошибку, для этой задачи он отключен аннотацией eslint-disable
//  * */

// function getKeys(obj) {
//   for (const key in obj) {
//     console.log(key);
//   }
// }

//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------

/* Для решения этой задачи используй for..in цикл. В реальных проектах это плохая практика,
 * лучше использовать методы класса Object - keys(), values(), entries(). Но мы с ними пока не познакомитись.
 * Чтобы eslint не ругался на эту ошибку, для этой задачи он отключен аннотацией eslint-disable
 * */

// const pickProps = (obj, props) => {
//   const result = {};
//   props.forEach(prop => {
//     if (obj.hasOwnProperty(prop)) {
//       result[prop] = obj[prop];
//     }
//   });
//   return result;
// };

// function pickProps(obj, props) {
//   const result = {};
//   props.forEach(prop => {
//     if (Object.keys(obj).includes(prop)) {
//       result[prop] = obj[prop];
//     }
//   });
//   return result;
// }

// // examples
// console.log(pickProps({ a: 1, b: 2, c: 3 }, ['a', 'c'])); // ==> { a: 1, c: 3 }
// console.log(pickProps({ a: 1, b: 2, c: 3 }, ['a', 'c', 'd', 'hex'])); // ==> { a: 1, c: 3 }

//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------
//------------------------------------------------

/* Для решения этой задачи используй for..in цикл. В реальных проектах это плохая практика,
 * лучше использовать методы класса Object - keys(), values(), entries(). Но мы с ними пока не познакомитись.
 * */

// const getAdults = obj => {
//   const adultsUsers = {};

//   for (const key in obj) {
//     if (obj[key] >= 18) {
//       adultsUsers[key] = obj[key];
//     }
//   }

//   return adultsUsers;
// };

// // examples
// console.log(getAdults({ 'John Doe': 19, Tom: 17, Bob: 18 })); // ==> { 'John Doe': 19, Bob: 18 }
// console.log(getAdults({ Ann: 56, Andrey: 7 })); // ==> { Ann: 56 }
