// як можна форматувати дату

/*
const t = new Date();
t.toDateString();
'Thu Mar 14 2024'
-- Стандартні методи --
*/

/* 
є встроєний в JavaScript об'єкт, який допомагає форматувати дату та час:
'en' - локалізація (перший аргумент)
{} - об'єкт з опціями настрорйок, як цей об'єкт буде відпрацьовувати
*/
const formatter = new Intl.DateTimeFormat("en", {
  // хочу виводити час в 24 форматі
  // timeZone: 'UTC', // 11:32
  hour: "2-digit",
  minute: "2-digit",
  hour12: false,
});

const getTime = date => formatter.format(date);

console.log(getTime(new Date())); // 13:32


/*
Date.UTC(2024, 2, 14)
1710374400000
new Date(Date.UTC(2024, 2, 14)); 
Thu Mar 14 2024 02:00:00 GMT+0200 (Восточная Европа, стандартное время) - метод UTC задав ці параметри для 0 часового поясу
  - создає точку для нульового меридіана (по Грінвічу)
new Date(2024, 2, 14);
Thu Mar 14 2024 00:00:00 GMT+0200 (Восточная Европа, стандартное время) - це інший результат, тобто інший час (це не одне й те саме)
  - создає точку для мого локального часового поясу

const a = new Date();
a.getHours();
13 - локальний часовий пояс
a.getUTCHours();
11 - по Грінвічу
*/